In [ ]:
#through this small project I have understood the working of median,percentile and its usage in data cleaning and processing

In [1]:
import numpy as np
import pandas as pd

In [5]:
#names=["name","income"]: This specifies that the columns of the DataFrame should be named "name" and "income". Even if the file has its own headers, this will replace them with the specified column names.
#skiprows=[0]: This tells pandas to skip the first row of the CSV file, typically the header or a row you want to ignore.
df=pd.read_csv("C:/Users/prane/Downloads/income.csv",names=["name","income"],skiprows=[0])

In [6]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [7]:
df.income.describe()
#this gives basic statistics of the  dataframe

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [8]:
df.income.quantile(0.75)
#gives the 75 percentile

np.float64(7750.0)

In [9]:
df.income.quantile(0.45)

np.float64(6700.0)

In [ ]:
#to check for any documentation of the code do shift+tab

In [10]:
#remvoing outlier

In [11]:
df_no_outlier=df[df.income<df.income.quantile(.99)]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [12]:
df.income

0        5000
1        6000
2        4000
3        7500
4        8000
5        7000
6    10000000
Name: income, dtype: int64

In [ ]:
#to replace value on a specific cell as null

In [22]:
df['income'][3]=np.nan

C:\Users\prane\AppData\Local\Temp\ipykernel_19388\385840147.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3]=np.nan
C:\Users\prane\AppData\Local\Temp\ipykernel_19388\385840147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.nan

In [23]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [24]:
#fiilin gth missing value with median
df_new=df.fillna(df.income.median())

In [25]:
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [26]:
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [27]:
df_new.income.mean()

np.float64(1433785.7142857143)

In [28]:
df_no_outlier.income.mean()

np.float64(6250.0)

In [ ]:
#see the difference because of the outlier